"""
1. Задание
дана переменная
"""
dog = "Шарик"
action = "Играет"
toy = "Мячик"
res = dog + ' ' + action + ' в ' + toy

print(res)

# напечатать на экране фразу по шаблону {dog} {action} в {toy}